
/***********************************矩阵运算******************************/

#ifndef _Matrix_operation_h_
#define _Matrix_operation_h_

//#include<iostream>

 /*************求矩阵的逆矩阵***************
   输入：矩阵a，矩阵维数n
   输出：逆矩阵a
   返回值：1变换逆矩阵成功 
           0失败
 ********************************************/
int Matrix_inverse(double a[],int n);  


/**************求矩阵的转置矩阵*************
  输入：矩阵的行数m 列数n 以及矩阵a 
  输出：储存转制后的数据矩阵b
  返回值：1成功
  *****************************************/
int Matrix_trans(int m,int n,double *a,double *b);

/*************矩阵的乘法*******************
 输入:m n矩阵a的行数和列数
      n,k矩阵b的行数和列数
	  a b矩阵
 输出：c矩阵
 返回值
 ******************************************/

int Matrix_mul(double a[], double b[],int m,int n,int k,double c[]);

#endif
