#include"sg_filt.h"
#include"Matrix_operation.h"


#define N 11
#define M 5

//N=11 D=2
const float B[N][N]=
{
    {  0.580420,  0.377622,  0.209790,  0.076923, -0.020979, -0.083916, -0.111888, -0.104895, -0.062937,  0.013986,  0.125874},
    {  0.377622,  0.278322,  0.193007,  0.121678,  0.064336,  0.020979, -0.008392, -0.023776, -0.025175, -0.012587,  0.013986},
    {  0.209790,  0.193007,  0.173893,  0.152448,  0.128671,  0.102564,  0.074126,  0.043357,  0.010256, -0.025175, -0.062937},
    {  0.076923,  0.121678,  0.152448,  0.169231,  0.172028,  0.160839,  0.135664,  0.096503,  0.043357, -0.023776, -0.104895},
    { -0.020979,  0.064336,  0.128671,  0.172028,  0.194406,  0.195804,  0.176224,  0.135664,  0.074126, -0.008392, -0.111888},
    { -0.083916,  0.020979,  0.102564,  0.160839,  0.195804,  0.207459,  0.195804,  0.160839,  0.102564,  0.020979, -0.083916},
    { -0.111888, -0.008392,  0.074126,  0.135664,  0.176224,  0.195804,  0.194406,  0.172028,  0.128671,  0.064336, -0.020979},
    { -0.104895, -0.023776,  0.043357,  0.096503,  0.135664,  0.160839,  0.172028,  0.169231,  0.152448,  0.121678,  0.076923},
    { -0.062937, -0.025175,  0.010256,  0.043357,  0.074126,  0.102564,  0.128671,  0.152448,  0.173893,  0.193007,  0.209790},
    {  0.013986, -0.012587, -0.025175, -0.023776, -0.008392,  0.020979,  0.064336,  0.121678,  0.193007,  0.278322,  0.377622},
    {  0.125874,  0.013986, -0.062937, -0.104895, -0.111888, -0.083916, -0.020979,  0.076923,  0.209790,  0.377622,  0.580420}
};



/*********************************滤波器数组*******************************/
static double buf_N[N]= {0};                  //SG平滑滤波数组
//static double IIR_Filter_Data[L];           //缓存数组，储存滤波之后的时域信号 float类型
static  double SG_Filter_Data[L];            //SG平滑之后数据


double * First_filter_buf1(double * IIR_Filter_Data)
{
	int i=0,j; 
    
    for(i=0; i<=M; i++)          //第0到M，一共M+1个点
    {
        for(j=0; j<N; j++)
        {
            SG_Filter_Data[i]=SG_Filter_Data[i]+B[j][i]*IIR_Filter_Data[j];
        }
    }
    for(i=0; i<N; i++)          //将数据放入缓存数组中
    {
        buf_N[0]=buf_N[1];
        buf_N[1]=buf_N[2];
        buf_N[2]=buf_N[3];
        buf_N[3]=buf_N[4];
        buf_N[4]=buf_N[5];
        buf_N[5]=buf_N[6];
        buf_N[6]=buf_N[7];
        buf_N[7]=buf_N[8];
        buf_N[8]=buf_N[9];      //数据移位
        buf_N[9]=buf_N[10];
        buf_N[10]=IIR_Filter_Data[i];
    }
    for(i=M+1; i<L-M; i++)          //第M+1到L-1，一共L-M-1个点
    {

        for(j=0; j<N; j++)
        {
            SG_Filter_Data[i]=SG_Filter_Data[i]+B[j][M]*buf_N[j];
        }
        buf_N[0]=buf_N[1];
        buf_N[1]=buf_N[2];
        buf_N[2]=buf_N[3];
        buf_N[3]=buf_N[4];
        buf_N[4]=buf_N[5];
        buf_N[5]=buf_N[6];
        buf_N[6]=buf_N[7];
        buf_N[7]=buf_N[8];
        buf_N[8]=buf_N[9];     //数据移位
        buf_N[9]=buf_N[10];
        buf_N[10]=IIR_Filter_Data[i+M];
    }
	return  SG_Filter_Data;
}


double *  Else_filter_buf1(double * IIR_Filter_Data)
{
    int i=0,j; 
    for(i=0; i<L; i++)          //第0到M，一共M+1个点
    {
        buf_N[0]=buf_N[1];
        buf_N[1]=buf_N[2];
        buf_N[2]=buf_N[3];
        buf_N[3]=buf_N[4];
        buf_N[4]=buf_N[5];
        buf_N[5]=buf_N[6];
        buf_N[6]=buf_N[7];
        buf_N[7]=buf_N[8];
        buf_N[8]=buf_N[9];    //数据移位
        buf_N[9]=buf_N[10];
        buf_N[10]=IIR_Filter_Data[i];
        for(j=0; j<N; j++)
        {
            SG_Filter_Data[i]=SG_Filter_Data[i]+B[j][M]*buf_N[j];
        }
    }
	
		return  SG_Filter_Data;  
}



